wisp-tests/2025-04-27-14h26/data/attachments/7fe2178c1fedfe02.txt

URL: https://api.uat.platform.pagopa.it/nodo/node-for-psp/v1
Request:
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
	<soapenv:Header />
	<soapenv:Body>
		<nod:activatePaymentNoticeV2Request>
			<idPSP>AGID_01</idPSP>
			<idBrokerPSP>97735020584</idBrokerPSP>
			<idChannel>97735020584_03</idChannel>
			<password>***</password>
			<idempotencyKey>351174576322510266_0317474824</idempotencyKey>
			<qrCode>
				<fiscalCode>15376371009</fiscalCode>
				<noticeNumber>351174576322510266</noticeNumber>
			</qrCode>
			<expirationTime>900000</expirationTime>
			<amount>245.16</amount>
			<paymentNote>ab7f898a-7430-4ee7-b306-db03dab4c674</paymentNote>
		</nod:activatePaymentNoticeV2Request>
	</soapenv:Body>
</soapenv:Envelope>
